Documents/Renault_CRM_ЗаявкаНаТрейдИн.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_CRM_ЗаявкаНаТрейдИн</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодВыпуска</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Одобрена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполненаУспешно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Черновик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_CRM_СтатусЗаявокТрейдИн</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Марка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерЗаявитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерТрейдИн</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемДвигателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДвигателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТоплива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКПП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКПП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/CRM_ВоронкаПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ВоронкаПродаж</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ЭтапыПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Renault_CRM_СтатусЗаявокТрейдИн.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_CRM_СтатусЗаявокТрейдИн</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРассмотрении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполненаОценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаправленаНаДиагностику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДиагностикаПроведена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеЗавершено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Renault_CRM_ЗаявкаНаТрейдИн/Ext/ObjectModule.bsl
// Общий журнал
Перем Права Экспорт;
Перем Организация Экспорт;

Функция ПолучитьСписокПечатныхФорм() Экспорт
	Возврат Новый СписокЗначений();	
КонецФункции
//Конец необходимых для общих журналов

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ОтказУд = ложь;
	ОбработкаУдаленияПроведения(ОтказУд);
	
	НаборЗаявка = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьНаборЗаписей();
	НаборЗаявка.Отбор.IDK.Установить(РабочийЛист);
	НаборЗаявка.Отбор.ЭтапПродаж.Установить(Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИн);
	НаборЗаявкаОдобрена = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьНаборЗаписей();
	НаборЗаявкаОдобрена.Отбор.IDK.Установить(РабочийЛист);
	НаборЗаявкаОдобрена.Отбор.ЭтапПродаж.Установить(Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнОдобрена);
	НаборЗаявкаВыполнена = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьНаборЗаписей();
	НаборЗаявкаВыполнена.Отбор.IDK.Установить(РабочийЛист);
	НаборЗаявкаВыполнена.Отбор.ЭтапПродаж.Установить(Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнВыполнена);

	Если Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.Черновик Тогда
		Нов = НаборЗаявка.Добавить();
		Нов.IDK = РабочийЛист;
		Нов.Объект = ЭтотОбъект.Ссылка;
		Нов.ДатаВыполнения = ЭтотОбъект.Дата;
		Нов.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
		Нов.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИн;
		НаборЗаявка.Записать();

		НаборЗаявкаВыполнена.Записать();
		НаборЗаявкаОдобрена.Записать();
	Иначе
		Нов = НаборЗаявка.Добавить();
		Нов.IDK = РабочийЛист;
		Нов.Объект = ЭтотОбъект.Ссылка;
		Нов.ДатаВыполнения = ЭтотОбъект.Дата;
		Нов.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
		Нов.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИн;
		НаборЗаявка.Записать();
		
		Если Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.Одобрена Тогда
			Нов = НаборЗаявкаОдобрена.Добавить();
			Нов.IDK = РабочийЛист;
			Нов.Объект = ЭтотОбъект.Ссылка;
			Нов.ДатаВыполнения = ЭтотОбъект.Дата;
			Нов.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
			Нов.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнОдобрена;
			НаборЗаявкаОдобрена.Записать();
	
		КонецЕсли;
		Если Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.Выполнена Тогда
			
			Нов = НаборЗаявкаОдобрена.Добавить();
			Нов.IDK = РабочийЛист;
			Нов.Объект = ЭтотОбъект.Ссылка;
			Нов.ДатаВыполнения = ЭтотОбъект.Дата;
			Нов.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
			Нов.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнОдобрена;
			НаборЗаявкаОдобрена.Записать();

			
			Нов = НаборЗаявкаВыполнена.Добавить();
			Нов.IDK = РабочийЛист;
			Нов.Объект = ЭтотОбъект.Ссылка;
			Нов.ДатаВыполнения = ЭтотОбъект.Дата;
			Нов.ДилерскийЦентр = ЭтотОбъект.ДилерскийЦентр;
			Нов.ЭтапПродаж = Справочники.CRM_ЭтапыПродаж.ЗаявкаНаТрейдИнВыполнена;
			НаборЗаявкаВыполнена.Записать();

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_ВоронкаПродаж.IDK,
	               |	CRM_ВоронкаПродаж.ЭтапПродаж,
	               |	CRM_ВоронкаПродаж.ДатаВыполнения,
	               |	CRM_ВоронкаПродаж.Объект
	               |ИЗ
	               |	РегистрСведений.CRM_ВоронкаПродаж КАК CRM_ВоронкаПродаж
	               |ГДЕ
	               |	CRM_ВоронкаПродаж.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Запись.Удалить();
		КонецЕсли;
	КонецЦикла;
		//Оповестить("ОбновитьРабочийЛист");
	
КонецПроцедуры

	Процедура УстановитьСтатус(вхСтатус) Экспорт
	
	Статус = вхСтатус;
	Если Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.Выполнена Тогда
		Черновик=Ложь;
		Одобрена = Истина;
		Закрыта = Истина;
		ВыполненаУспешно = Истина;
	ИначеЕсли  Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.НаРассмотрении Тогда
		Черновик=Ложь;
		Одобрена = Ложь;
		Закрыта = Ложь;
		ВыполненаУспешно = Ложь;
	ИначеЕсли  Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.Одобрена Тогда
		Черновик=Ложь;
		Одобрена = Истина;
		Закрыта = Ложь;
		ВыполненаУспешно = Ложь;
	ИначеЕсли  Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.Отменена Тогда
		Черновик=Ложь;
		//Одобрена = Ложь;
		Закрыта = Истина;
		ВыполненаУспешно = Ложь;
	ИначеЕсли  Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.Черновик Тогда
		Черновик=Истина;
		Одобрена = Ложь;
		Закрыта = Ложь;
		ВыполненаУспешно = Ложь;
	Иначе
		Статус = Перечисления.Renault_CRM_СтатусЗаявокТрейдИн.Черновик;
		Черновик=Истина;
		Одобрена = Ложь;
		Закрыта = Ложь;
		ВыполненаУспешно = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры
